---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookTypen1
source: html/faec3220-ba29-93fa-9a4a-325510cae1ad.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookTypen1 Property

"Primary Bar - End Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinEndHookTypen1 { get; }
```